GaytaHub/ProjectCar/Libraries/drives/src/MK60DN10_sdhc.c
/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2016,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：179029047
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		MK60DN10_sdhc.c
 * @brief      		sdhc函数库
 * @company	   		成都逐飞科技有限公司
 * @author     		Go For It(1325536866)
 * @version    		v1.0
 * @Software 		IAR 7.7 or MDK 5.17
 * @Target core		MK60DN512VLL10
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2016-02-25
 ********************************************************************************************************************/
 

 
#include "MK60DN10_sdhc.h"

#define TRUE    1
#define FALSE	0


//SD卡信息全局变量
SDCARD_STRUCT_PTR sdcard_ptr;


//-------------------------------------------------------------------------------------------------------------------
//  @brief      SDHC模块相关的GPIO引脚初始化
//  @param      init    PCR寄存器掩码
//  @return     void   
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static void sdhc_initgpio(uint32 init)
{  
    port_init (E0, init & (ALT4 | PULLUP | HDS));
    port_init (E1, init & (ALT4 | PULLUP | HDS));
    port_init (E2, init & (ALT4 | HDS));
    port_init (E3, init & (ALT4 | PULLUP | HDS));
    port_init (E4, init & (ALT4 | PULLUP | HDS));
    port_init (E5, init & (ALT4 | PULLUP | HDS));
  
    SIM->SCGC3 |= SIM_SCGC3_SDHC_MASK; 
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      设置SDHC波特率
//  @param      baud    SDHC期望时钟频率，单位Hz
//  @return     void   
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static void sdhc_setbaudrate(uint32 baud)
{
    uint32 pres, div, min, minpres = 0x80, mindiv = 0x0F;
    int32  val;
    uint32 clock = bus_clk_mhz*1000*1000;
    //找到相近的分频因子
    min = (uint32)-1;
    for (pres = 2; pres <= 256; pres <<= 1)
    {
        for (div = 1; div <= 16; div++)
        {
            val = pres * div * baud - clock;
            if (val >= 0)
            {
                if (min > val)
                {
                  min = val;
                  minpres = pres;
                  mindiv = div;
                }
            }
        }
    }
    
    //禁止SDHC模块时钟
    SDHC->SYSCTL &= (~ SDHC_SYSCTL_SDCLKEN_MASK);
    
    //修改分频因子
    div = SDHC->SYSCTL & (~ (SDHC_SYSCTL_DTOCV_MASK | SDHC_SYSCTL_SDCLKFS_MASK | SDHC_SYSCTL_DVS_MASK));
    SDHC->SYSCTL = div | (SDHC_SYSCTL_DTOCV(0x0E) | SDHC_SYSCTL_SDCLKFS(minpres >> 1) | SDHC_SYSCTL_DVS(mindiv - 1));
    
    //等在时钟稳定
    while (0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_SDSTB_MASK));

    //使能SDHC模块时钟
    SDHC->SYSCTL |= SDHC_SYSCTL_SDCLKEN_MASK;
    SDHC->IRQSTAT |= SDHC_IRQSTAT_DTOE_MASK;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      获取SDHC模块运行状态
//  @return     void   
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static uint8 sdhc_isrunning(void)
{
    return (0 != (SDHC->PRSSTAT & (SDHC_PRSSTAT_RTA_MASK | SDHC_PRSSTAT_WTA_MASK | SDHC_PRSSTAT_DLA_MASK | SDHC_PRSSTAT_CDIHB_MASK | SDHC_PRSSTAT_CIHB_MASK)));
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      等待指定状态标志位置位
//  @param      mask    状态标志位掩码
//  @return     void   
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static uint32 sdhc_waitstatus(uint32 mask)
{
    uint32 result;
    do
    {
        result = SDHC->IRQSTAT & mask;
    }
    while (0 == result);
    return result;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      SDHC模块初始化函数
//  @param      baud    SDHC期望时钟频率，单位Hz
//  @return     SDHCSTA_OK--状态正常
//              SDHCSTA_NOINIT--驱动未初始化
//              SDHCSTA_NODISK--为插入卡
//              SDHCSTA_PROTECT--卡写保护
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static SDHCRES sdhc_init(uint32 baud)
{
  
    sdcard_ptr->CARD = ESDHC_CARD_NONE;
    
    //禁用GPIO的SDHC复用功能
    sdhc_initgpio (0);
    
    //复位SDHC模块
    SDHC->SYSCTL = SDHC_SYSCTL_RSTA_MASK | SDHC_SYSCTL_SDCLKFS(0x80);
    while (SDHC->SYSCTL & SDHC_SYSCTL_RSTA_MASK){};
    
    //初始化寄存器值
    SDHC->VENDOR = 0;
    SDHC->BLKATTR = SDHC_BLKATTR_BLKCNT(1) | SDHC_BLKATTR_BLKSIZE(512);
    SDHC->PROCTL = SDHC_PROCTL_EMODE(ESDHC_PROCTL_EMODE_LITTLE) | SDHC_PROCTL_D3CD_MASK;
    SDHC->WML = SDHC_WML_RDWML(2) | SDHC_WML_WRWML(1);
    
    //设置SDHC初始化时钟，最好不要超过400kHz
    sdhc_setbaudrate (baud);
    
    //等待
    while (SDHC->PRSSTAT & (SDHC_PRSSTAT_CIHB_MASK | SDHC_PRSSTAT_CDIHB_MASK)){};
    
    //使能GPIO的SDHC复用
    sdhc_initgpio (0xFFFF);
    
    //使能各种请求
    SDHC->IRQSTAT = 0xFFFF;
    SDHC->IRQSTATEN = SDHC_IRQSTATEN_DEBESEN_MASK | SDHC_IRQSTATEN_DCESEN_MASK | SDHC_IRQSTATEN_DTOESEN_MASK
      | SDHC_IRQSTATEN_CIESEN_MASK | SDHC_IRQSTATEN_CEBESEN_MASK | SDHC_IRQSTATEN_CCESEN_MASK | SDHC_IRQSTATEN_CTOESEN_MASK
        | SDHC_IRQSTATEN_BRRSEN_MASK | SDHC_IRQSTATEN_BWRSEN_MASK | SDHC_IRQSTATEN_CRMSEN_MASK
          | SDHC_IRQSTATEN_TCSEN_MASK | SDHC_IRQSTATEN_CCSEN_MASK;
    
    //等待80个初始时钟
    SDHC->SYSCTL |= SDHC_SYSCTL_INITA_MASK;
    while (SDHC->SYSCTL & SDHC_SYSCTL_INITA_MASK){};
    
    //检查卡是否插入
    if (SDHC->PRSSTAT & SDHC_PRSSTAT_CINS_MASK)
    {
        sdcard_ptr->CARD = ESDHC_CARD_UNKNOWN;
    }
    else
    {
        sdcard_ptr->STATUS = SDHCSTA_NODISK;
    }
    SDHC->IRQSTAT |= SDHC_IRQSTAT_CRM_MASK;
    
