GaytaHub/ProjectCar/Libraries/drives/src/MK60DN10_sdhc.c
    return SDHCRES_OK;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      向SD卡发送指定CMD命令
//  @param      command    SDHC命令信息结构体
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static SDHCRES sdhc_sendcommand(ESDHC_COMMAND_STRUCT_PTR command)
{
    uint32 xfertyp;
    uint32 blkattr;
    
    //检查命令
    xfertyp = command->COMMAND;
    
    if (ESDHC_XFERTYP_CMDTYP_RESUME == ((xfertyp & SDHC_XFERTYP_CMDTYP_MASK) >> SDHC_XFERTYP_CMDTYP_SHIFT))
    {
      //恢复类型命令必须设置DPSEL位
        xfertyp |= SDHC_XFERTYP_DPSEL_MASK;
    }
    
    if ((0 != command->BLOCKS) && (0 != command->BLOCKSIZE))
    {
        xfertyp |= SDHC_XFERTYP_DPSEL_MASK;
        if (command->BLOCKS != 1)
        {
          //多块传输
            xfertyp |= SDHC_XFERTYP_MSBSEL_MASK;
        }
        if ((uint32)-1 == command->BLOCKS)
        {
          //大量传输
            blkattr = SDHC_BLKATTR_BLKSIZE(command->BLOCKSIZE) | SDHC_BLKATTR_BLKCNT(0xFFFF);
        }
        else
        {
            blkattr = SDHC_BLKATTR_BLKSIZE(command->BLOCKSIZE) | SDHC_BLKATTR_BLKCNT(command->BLOCKS);
            xfertyp |= SDHC_XFERTYP_BCEN_MASK;
        }
    }
    else
    {
        blkattr = 0;
    }
    
    //卡移除状态清除
    SDHC->IRQSTAT |= SDHC_IRQSTAT_CRM_MASK;
    
    //等待CMD线空闲
    while (SDHC->PRSSTAT & SDHC_PRSSTAT_CIHB_MASK);
    
    //初始化命令
    SDHC->CMDARG = command->ARGUMENT;
    SDHC->BLKATTR = blkattr;
    SDHC->DSADDR = 0;
    
    //发送命令
    SDHC->XFERTYP = xfertyp;
    
    //等待响应
    if (sdhc_waitstatus (SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CC_MASK) != SDHC_IRQSTAT_CC_MASK)
    {
        SDHC->IRQSTAT |= SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CIE_MASK | SDHC_IRQSTAT_CEBE_MASK | SDHC_IRQSTAT_CCE_MASK | SDHC_IRQSTAT_CC_MASK;
        return SDHCRES_ERROR;
    }
    
    //检查卡是否移除
    if (SDHC->IRQSTAT & SDHC_IRQSTAT_CRM_MASK)
    {
        SDHC->IRQSTAT |= SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CC_MASK;
        sdcard_ptr->STATUS = SDHCSTA_NODISK;
        return SDHCRES_NOTRDY;
    }
    
    //获取响应
    if (SDHC->IRQSTAT & SDHC_IRQSTAT_CTOE_MASK)
    {
        SDHC->IRQSTAT |= SDHC_IRQSTAT_CTOE_MASK | SDHC_IRQSTAT_CC_MASK;
        return SDHCRES_NONRSPNS;
    }
    if ((xfertyp & SDHC_XFERTYP_RSPTYP_MASK) != SDHC_XFERTYP_RSPTYP(ESDHC_XFERTYP_RSPTYP_NO))
    {
        command->RESPONSE[0] = SDHC->CMDRSP[0];
        if ((xfertyp & SDHC_XFERTYP_RSPTYP_MASK) == SDHC_XFERTYP_RSPTYP(ESDHC_XFERTYP_RSPTYP_136))
        {
            command->RESPONSE[1] = SDHC->CMDRSP[1];
            command->RESPONSE[2] = SDHC->CMDRSP[2];
            command->RESPONSE[3] = SDHC->CMDRSP[3];
        }
    }
    SDHC->IRQSTAT |= SDHC_IRQSTAT_CC_MASK;
    
    return SDHCRES_OK;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      SDHC模块其他控制服务函数
//  @param      cmd             SDHC模块控制命令
//  @param      *param_ptr      控制参数
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       
//-------------------------------------------------------------------------------------------------------------------
SDHCRES sdhc_ioc(uint32 cmd, void *param_ptr)
{
  
    ESDHC_COMMAND_STRUCT    command;
    uint8                 mem, mp, hc;
    int32                  val;
    SDHCRES                 result = SDHCRES_OK;
    uint32 *             param32_ptr = param_ptr;
    
    switch (cmd)
    {
      case IO_IOCTL_ESDHC_INIT:  
        //初始化SDHC模块
        result = sdhc_init (400000);
        if (SDHCRES_OK != result)
        {
            break;
        }
        
        mem = FALSE;
        hc = FALSE;
        mp = FALSE;
        
        //CMD0 - 空闲命令，复位卡
        command.COMMAND = ESDHC_CMD0;
        command.ARGUMENT = 0;
        command.BLOCKS = 0;
        result = sdhc_sendcommand (&command);
        if (result!=SDHCRES_OK)
        {
            sdcard_ptr->STATUS = SDHCSTA_NOINIT;
            break;
        }
        
        //CMD8 - 发送接口状态，检查是否支持高容量
        command.COMMAND = ESDHC_CMD8;
        command.ARGUMENT = 0x000001AA;
        command.BLOCKS = 0;
        result = sdhc_sendcommand (&command);
        if (result==SDHCRES_ERROR)
        {
            sdcard_ptr->STATUS = SDHCSTA_NOINIT;
            break;
        }
        if (result == SDHCRES_OK)
        {
            if (command.RESPONSE[0] != command.ARGUMENT)
            {
                sdcard_ptr->STATUS = SDHCSTA_NOINIT;
                result = SDHCRES_ERROR;
                break;
            }
            hc = TRUE;
        }
        
        //CMD5 - 发送操作状态，测试IO
        command.COMMAND = ESDHC_CMD5;
        command.ARGUMENT = 0;
        command.BLOCKS = 0;      
        result = sdhc_sendcommand (&command);
        if (result==SDHCRES_ERROR)
        {
            sdcard_ptr->STATUS = SDHCSTA_NOINIT;
            break;
        }
        if (result == SDHCRES_OK)
        {
            if (((command.RESPONSE[0] >> 28) & 0x07) && (command.RESPONSE[0] & 0x300000))
            {
                command.COMMAND = ESDHC_CMD5;
                command.ARGUMENT = 0x300000;
                command.BLOCKS = 0;
                val = 0;
                do
                {
                    val++;
                    result = sdhc_sendcommand (&command);
                    if (result)
                    {
                        break;
                    }
                } while ((0 == (command.RESPONSE[0] & 0x80000000)) && (val < ESDHC_ALARM_FREQUENCY));
                if (SDHCRES_OK != result)
                {
                    break;
                }
                if (command.RESPONSE[0] & 0x08000000)
                {
                    mp = TRUE;
                }
            }
        }
        else
        {
            mp = TRUE;
        }
        
        if (mp)
        {
          //CMD55 - 特殊应用命令，检查MMC卡
          command.COMMAND = ESDHC_CMD55;
          command.ARGUMENT = 0;
          command.BLOCKS = 0;
          result = sdhc_sendcommand (&command);
          if (result==SDHCRES_ERROR)
          {
              break;
          }
          if (result != SDHCRES_NONRSPNS)
          {
            //如果为SD卡
            //ACMD41 - 发送操作状态
            command.COMMAND = ESDHC_ACMD41;
            command.ARGUMENT = 0;
            command.BLOCKS = 0;
            result = sdhc_sendcommand (&command);
            if (result)
            {
                sdcard_ptr->STATUS = SDHCSTA_NOINIT;
                break;
            }
            if (command.RESPONSE[0] & 0x300000)
            {
              val = 0;
              do
              {
                  val++;
                  
                  //CMD55 + ACMD41 - 发送OCR
                  command.COMMAND = ESDHC_CMD55;
                  command.ARGUMENT = 0;
                  command.BLOCKS = 0;
                  result = sdhc_sendcommand (&command);
                  if (result)
                  {
                      break;
                  }
                  
                  command.COMMAND = ESDHC_ACMD41;
                  if (hc)
                  {
                      command.ARGUMENT = 0x40300000;
                  }
                  else
                  {
                      command.ARGUMENT = 0x00300000;
                  }
                  command.BLOCKS = 0;
                  result = sdhc_sendcommand (&command);
                  if (result)
                  {
                      break;
                  }
              } while ((0 == (command.RESPONSE[0] & 0x80000000)) && (val < ESDHC_ALARM_FREQUENCY));
              if (SDHCRES_OK != result)
              {
                  break;
              }
              if (val >= ESDHC_ALARM_FREQUENCY)
              {
                  hc = FALSE;
              }
              else
              {
                  mem = TRUE;
                  if (hc)
                  {
                      hc = FALSE;
                      if (command.RESPONSE[0] & 0x40000000)
                      {
                          hc = TRUE;
                      }
                  }
              }
            }
          }
        }
        if (mem)
        {
            sdcard_ptr->CARD = ESDHC_CARD_SD;
            if (hc)
            {
                sdcard_ptr->CARD = ESDHC_CARD_SDHC;
            }
        }

        
