GaytaHub/ProjectCar/Libraries/drives/src/MK60DN10_sdhc.c
        //禁用GPIO的SDHC复用
        //sdhc_initgpio (0);
        
        //设置SDHC工作状态下的默认波特率
        sdhc_setbaudrate (25000000);
        
        //使能GPIO的SDHC复用
        sdhc_initgpio (0xFFFF);
        
        if(result == SDHCRES_OK)
        {
            sdcard_ptr->STATUS = SDHCSTA_OK;
        }
        break;
        
      case IO_IOCTL_ESDHC_SEND_COMMAND:
        result = sdhc_sendcommand ((ESDHC_COMMAND_STRUCT_PTR)param32_ptr);
        break;
        
      case IO_IOCTL_ESDHC_GET_BAUDRATE:
        if (NULL == param32_ptr)
        {
            result = SDHCRES_ERROR;
        }
        else
        {
            //获取波特率
            val = ((SDHC->SYSCTL & SDHC_SYSCTL_SDCLKFS_MASK) >> SDHC_SYSCTL_SDCLKFS_SHIFT) << 1;
            val *= ((SDHC->SYSCTL & SDHC_SYSCTL_DVS_MASK) >> SDHC_SYSCTL_DVS_SHIFT) + 1;
            *param32_ptr = (uint32)((bus_clk_mhz*1000*1000 / val));
        }
        break;
        
      case IO_IOCTL_ESDHC_SET_BAUDRATE:
        if (NULL == param32_ptr)
        {
            result = SDHCRES_ERROR;
        }
        else if (0 == (*param32_ptr))
        {
            result = SDHCRES_ERROR;
        }
        else
        {
            if (! sdhc_isrunning ())
            {
                //禁用GPIO的SDHC复用
                sdhc_initgpio (0);
                
                //设置波特率
                sdhc_setbaudrate (*param32_ptr);
                
                //使能GPIO的SDHC复用
                sdhc_initgpio (0xFFFF);
            }
            else
            {
                result = SDHCRES_ERROR;
            }
        }
        break;
        
      case IO_IOCTL_ESDHC_GET_BUS_WIDTH:
        if (NULL == param32_ptr)
        {
            result = SDHCRES_ERROR;
        }
        else
        {
            //获得SDHC总线宽度
            val = (SDHC->PROCTL & SDHC_PROCTL_DTW_MASK) >> SDHC_PROCTL_DTW_SHIFT;
            if (ESDHC_PROCTL_DTW_1BIT == val)
            {
                *param32_ptr = ESDHC_BUS_WIDTH_1BIT;
            }
            else if (ESDHC_PROCTL_DTW_4BIT == val)
            {
                *param32_ptr = ESDHC_BUS_WIDTH_4BIT;
            }
            else if (ESDHC_PROCTL_DTW_8BIT == val)
            {
                *param32_ptr = ESDHC_BUS_WIDTH_8BIT;
            }
            else
            {
                result = SDHCRES_ERROR;
            }
        }
        break;
        
      case IO_IOCTL_ESDHC_SET_BUS_WIDTH:
        if (NULL == param32_ptr)
        {
            result = SDHCRES_ERROR;
        }
        else
        {
            //设置SDHC总线宽度
            if (! sdhc_isrunning ())
            {
                if (ESDHC_BUS_WIDTH_1BIT == *param32_ptr)
                {
                    SDHC->PROCTL &= (~ SDHC_PROCTL_DTW_MASK);
                    SDHC->PROCTL |= SDHC_PROCTL_DTW(ESDHC_PROCTL_DTW_1BIT);
                }
                else if (ESDHC_BUS_WIDTH_4BIT == *param32_ptr)
                {
                    SDHC->PROCTL &= (~ SDHC_PROCTL_DTW_MASK);
                    SDHC->PROCTL |= SDHC_PROCTL_DTW(ESDHC_PROCTL_DTW_4BIT);
                }
                else if (ESDHC_BUS_WIDTH_8BIT == *param32_ptr)
                {
                    SDHC->PROCTL &= (~ SDHC_PROCTL_DTW_MASK);
                    SDHC->PROCTL |= SDHC_PROCTL_DTW(ESDHC_PROCTL_DTW_8BIT);
                }
                else
                {
                    result = SDHCRES_ERROR;
                }
            }
            else
            {
                result = SDHCRES_ERROR;
            }
        }
        break;
        
      case IO_IOCTL_ESDHC_GET_CARD:
        if (NULL == param32_ptr)
        {
            result = SDHCRES_ERROR;
        }
        else
        {
            //等待80个时钟
            SDHC->SYSCTL |= SDHC_SYSCTL_INITA_MASK;
            while (SDHC->SYSCTL & SDHC_SYSCTL_INITA_MASK);
            
            //更新并返回卡实际状态
            if (SDHC->IRQSTAT & SDHC_IRQSTAT_CRM_MASK)
            {
                SDHC->IRQSTAT |= SDHC_IRQSTAT_CRM_MASK;
                sdcard_ptr->CARD = ESDHC_CARD_NONE;
                sdcard_ptr->STATUS = SDHCSTA_NODISK;
            }
            if (SDHC->PRSSTAT & SDHC_PRSSTAT_CINS_MASK)
            {
                if (ESDHC_CARD_NONE == sdcard_ptr->CARD)
                {
                    sdcard_ptr->CARD = ESDHC_CARD_UNKNOWN;
                }
            }
            else
            {
                sdcard_ptr->CARD = ESDHC_CARD_NONE;
            }
            *param32_ptr = sdcard_ptr->CARD;
        }
        break;
        
      case IO_IOCTL_FLUSH_OUTPUT:
        //等待传输完成
        sdhc_waitstatus (SDHC_IRQSTAT_TC_MASK);
        if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
        {
            SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK;
            result = SDHCRES_ERROR;
        }
        SDHC->IRQSTAT |= SDHC_IRQSTAT_TC_MASK | SDHC_IRQSTAT_BRR_MASK | SDHC_IRQSTAT_BWR_MASK;
        break;
        
        default:
        result = SDHCRES_ERROR;
        break;
    }
    
    
    return result;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      SDHC读操作
//  @param      *data_ptr     存储数据地址指针
//  @param      n             待读的数据长度
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static SDHCSTATUS sdhc_read(uint8 *data_ptr, int32 n)
{
    uint32 buffer;
    int32 remains;
    
    remains = n;
    if (((uint32)data_ptr & 0x03) == 0)
    {    
        //数据位字对齐，可以以最快的速度直接从寄存器拷贝
        while (remains >= 4)
        {
            if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
            {
                SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BRR_MASK;
                return SDHCRES_ERROR;
            }
            
