GaytaHub/ProjectCar/Libraries/drives/src/MK60DN10_sdhc.c
            //等待，直到收到的数据达到水印长度或传输完成
            while ((0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BREN_MASK)) && (SDHC->PRSSTAT & SDHC_PRSSTAT_DLA_MASK));
            
            *((uint32 *)data_ptr) = SDHC->DATPORT;
            data_ptr += 4;
            remains -= 4;
        }
    }
    else
    {
        //非对齐数据，读到临时区域并以字节复制
        while (remains >= 4)
        {
            if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
            {
                SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BRR_MASK;
                return SDHCRES_ERROR;
            }
            
            //等待，直到收到的数据达到水印长度或传输完成
            while ((0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BREN_MASK)) && (SDHC->PRSSTAT & SDHC_PRSSTAT_DLA_MASK));
            
            buffer = SDHC->DATPORT;
            
            *data_ptr++ = buffer & 0xFF;
            *data_ptr++ = (buffer >> 8) & 0xFF;
            *data_ptr++ = (buffer >> 16) & 0xFF;
            *data_ptr++ = (buffer >> 24) & 0xFF;
            
            remains -= 4;
        }      
    }
    
    if (remains)
    {
        //剩下的少于单字长度数据
        if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
        {
            SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BRR_MASK;
            return SDHCRES_ERROR;
        }
        
        //等待，直到收到的数据达到水印长度或传输完成
        while ((0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BREN_MASK)) && (SDHC->PRSSTAT & SDHC_PRSSTAT_DLA_MASK));
        
        buffer = SDHC->DATPORT;
        while (remains)
        {
          
            *data_ptr++ = buffer & 0xFF;
            buffer >>= 8;
            
            remains--;
        }
    }
    
    if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
    {
        SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BRR_MASK;
        return SDHCRES_ERROR;
    }
    
    return (n - remains);
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      SDHC读操作
//  @param      *data_ptr     存储数据地址指针
//  @param      n             待写的数据长度
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       内部使用，用户无需调用
//-------------------------------------------------------------------------------------------------------------------
static SDHCSTATUS sdhc_write(uint8 *data_ptr, int32 n)
{
    uint8 *udata_ptr;
    uint32 buffer;
    int32 remains;
    
    //复制数据指针
    udata_ptr = (uint8 *)data_ptr;
    
    remains = n;
    if (((uint32)udata_ptr & 0x03) == 0)
    {
        //数据位字对齐，可以以最快的速度直接拷贝到寄存器
        while (remains >= 4)
        {
            if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
            {
                SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BWR_MASK;
                return SDHCRES_ERROR;
            }
            
            //等待，直到水印空间可用 
            while (0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BWEN_MASK));
            
            SDHC->DATPORT = *((uint32 *)udata_ptr);
            udata_ptr += 4;
            remains -= 4;
        }
    }
    else
    {
        //非对齐数据，写到临时区域并以字节复制
        while (remains >= 4)
        {
            if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
            {
                SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BWR_MASK;
                return SDHCRES_ERROR;
            }
            
            //等待，直到水印空间可用 
            while (0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BWEN_MASK));
            
            buffer  = (*udata_ptr++);
            buffer |= (*udata_ptr++) << 8;
            buffer |= (*udata_ptr++) << 16;
            buffer |= (*udata_ptr++) << 24;
            
            //等待，直到水印空间可用 
            while (0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BWEN_MASK));
            
            SDHC->DATPORT = buffer;
            remains -= 4;
        }      
    }
    
    if (remains)
    {
        //剩余少于单字长度的数据
        if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
        {
            SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BWR_MASK;
            return SDHCRES_ERROR;
        }
        
        buffer = 0xFFFFFFFF;
        while (remains)
        {
            buffer <<= 8;
            buffer |= udata_ptr[remains];
            remains--;
        }
        
        //等待，直到水印空间可用 
        while (0 == (SDHC->PRSSTAT & SDHC_PRSSTAT_BWEN_MASK));
        
        SDHC->DATPORT = buffer;        
    }
    
    if (SDHC->IRQSTAT & (SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK))
    {
        SDHC->IRQSTAT |= SDHC_IRQSTAT_DEBE_MASK | SDHC_IRQSTAT_DCE_MASK | SDHC_IRQSTAT_DTOE_MASK | SDHC_IRQSTAT_BWR_MASK;
        return SDHCRES_ERROR;
    }
    
    return (n - remains);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      初始化SDHC模块及SD卡，设置正常工作波特率为25MHz
//  @return     SDHCSTA_OK--状态正常
//              SDHCSTA_NOINIT--驱动未初始化
//              SDHCSTA_NODISK--未插入卡
//              SDHCSTA_PROTECT--卡写保护
//  @since      v1.0
//  @note       
//-------------------------------------------------------------------------------------------------------------------
SDHCSTATUS sdhc_initcard(void)
{
    uint32 param, c_size, c_size_mult, read_bl_len, time_out = 0;
    ESDHC_COMMAND_STRUCT command;
    SDHCSTATUS result;
    
    //分配SD卡信息结构体的数据空间并初始化
    sdcard_ptr = (SDCARD_STRUCT_PTR)malloc(sizeof(SDCARD_STRUCT));
    sdcard_ptr->CARD = ESDHC_CARD_NONE;
    sdcard_ptr->TIMEOUT = 0;
    sdcard_ptr->NUM_BLOCKS = 0;
    sdcard_ptr->ADDRESS = 0;
    sdcard_ptr->HC = FALSE;
    sdcard_ptr->VERSION2 = FALSE;
    sdcard_ptr->STATUS = SDHCSTA_OK;
     
    while(time_out < 1000)
    {
      
        //初始化SDHC模块并检测卡
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_INIT, NULL)))
        {
            continue;
        }
        
        //SDHC检查
        param = 0;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_GET_CARD, &param)))
        {
            continue;
        }
        if ((ESDHC_CARD_SD == param) || (ESDHC_CARD_SDHC == param) || (ESDHC_CARD_SDCOMBO == param) || (ESDHC_CARD_SDHCCOMBO == param))
        {
            if ((ESDHC_CARD_SDHC == param) || (ESDHC_CARD_SDHCCOMBO == param))
            {
                sdcard_ptr->HC = TRUE;
                break;
            }
            else if(ESDHC_CARD_SD == param)
            {
                break;
            }
        }
        else
        {
            continue;
        }
        time_out++;
    }
    
    if(time_out >= 1000)
      return SDHCRES_NOTRDY;
    
    //卡识别
    command.COMMAND = ESDHC_CMD2;
    command.ARGUMENT = 0;
    command.BLOCKS = 0;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return result;
    }
    
