GaytaHub/ProjectCar/Libraries/drives/src/MK60DN10_sdhc.c
    //获取卡地址
    command.COMMAND = ESDHC_CMD3;
    command.ARGUMENT = 0;
    command.BLOCKS = 0;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return result;
    }
    sdcard_ptr->ADDRESS = command.RESPONSE[0] & 0xFFFF0000;
    
    //获取卡参数
    command.COMMAND = ESDHC_CMD9;
    command.ARGUMENT = sdcard_ptr->ADDRESS;
    command.BLOCKS = 0;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return result;
    }
    if (0 == (command.RESPONSE[3] & 0x00C00000))
    {
        read_bl_len = (command.RESPONSE[2] >> 8) & 0x0F;
        c_size = command.RESPONSE[2] & 0x03;
        c_size = (c_size << 10) | (command.RESPONSE[1] >> 22);
        c_size_mult = (command.RESPONSE[1] >> 7) & 0x07;
        sdcard_ptr->NUM_BLOCKS = (c_size + 1) * (1 << (c_size_mult + 2)) * (1 << (read_bl_len - 9));
    }
    else
    {
        sdcard_ptr->VERSION2 = TRUE;
        c_size = (command.RESPONSE[1] >> 8) & 0x003FFFFF;
        sdcard_ptr->NUM_BLOCKS = (c_size + 1) << 10;
    }
    
    //设置正常工作波特率为40MHz
    //param = 40000000;    
    param = 25000000;      
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SET_BAUDRATE, &param)))
    {
        return result;
    }
    
    //选择卡
    command.COMMAND = ESDHC_CMD7;
    command.ARGUMENT = sdcard_ptr->ADDRESS;
    command.BLOCKS = 0;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return result;
    }
    
    //设置块大小为512字节
    command.COMMAND = ESDHC_CMD16;
    command.ARGUMENT = IO_SDCARD_BLOCK_SIZE;
    command.BLOCKS = 0;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return result;
    }
    
    if (ESDHC_BUS_WIDTH_4BIT == ESDHC_BUS_WIDTH_4BIT)
    {
        //特殊应用命令
        command.COMMAND = ESDHC_CMD55;
        command.ARGUMENT = sdcard_ptr->ADDRESS;
        command.BLOCKS = 0;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
        {
            return result;
        }
        
        //设置总线宽度为4bit
        command.COMMAND = ESDHC_ACMD6;
        command.ARGUMENT = 2;
        command.BLOCKS = 0;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
        {
            return result;
        }
        
        param = ESDHC_BUS_WIDTH_4BIT;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SET_BUS_WIDTH, &param)))
        {
            return result;
        }
    }
    
    return SDHCRES_OK;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      读指定扇区指定长度的块
//  @param      buff            存储读出数据的地址指针
//  @param      sector          开始的扇区号
//  @param      count           读出的扇区数（块数）
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       
//-------------------------------------------------------------------------------------------------------------------
SDHCRES sdhc_readblocks(uint8 *buff, uint32 sector, uint32 count)
{
    ESDHC_COMMAND_STRUCT command;
    int cnt;
    int32 result;
    
    //SD卡数据地址调节
    if (! sdcard_ptr->HC)
    {
        sector <<= IO_SDCARD_BLOCK_SIZE_POWER;
    }
    
    //设置读块命令
    if (count > 1)
    {
        command.COMMAND = ESDHC_CMD18;
    }   
    else
    {
        command.COMMAND = ESDHC_CMD17;
    }
    
    command.ARGUMENT = sector;
    command.BLOCKS = count;
    command.BLOCKSIZE = IO_SDCARD_BLOCK_SIZE;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return (SDHCRES)result;
    }
    
    //读取数据
    for (cnt = 0; cnt < count; cnt++)
    {
        if (IO_SDCARD_BLOCK_SIZE != (result=sdhc_read(buff,IO_SDCARD_BLOCK_SIZE)))
        {
            return (SDHCRES)result;
        }
        buff += IO_SDCARD_BLOCK_SIZE;
    }
    
    //等待传输结束
    if (SDHCRES_OK !=(result=sdhc_ioc (IO_IOCTL_FLUSH_OUTPUT, NULL)))
    {
        return (SDHCRES)result;
    }
    
    return (SDHCRES)result;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      在指定扇区写入指定长度块数数据
//  @param      buff            存储读出数据的地址指针
//  @param      sector          开始的扇区号
//  @param      count           写入的扇区数（块数）
//  @return     SDHCRES--磁盘功能返回值
//  @since      v1.0
//  @note       
//-------------------------------------------------------------------------------------------------------------------
SDHCRES sdhc_writeblocks(uint8* buff, uint32 sector, uint32 count)
{
    ESDHC_COMMAND_STRUCT command;
    uint8               tmp[4];
    int32             cnt;
      int32 result;
    
 
    //SD卡数据地址调节
    if (! sdcard_ptr->HC)
    {
        sector <<= IO_SDCARD_BLOCK_SIZE_POWER;
    }

    //设置写块命令
    if (count > 1)
    {
        command.COMMAND = ESDHC_CMD25;
    }
    else
    {
        command.COMMAND = ESDHC_CMD24;
    }

    command.ARGUMENT = sector;
    command.BLOCKS = count;
    command.BLOCKSIZE = IO_SDCARD_BLOCK_SIZE;
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
    {
        return (SDHCRES)result;
    }
    
    //写数据
    for (cnt = 0; cnt < count; cnt++)
    {
        if (IO_SDCARD_BLOCK_SIZE != (result=sdhc_write (buff, IO_SDCARD_BLOCK_SIZE)))
        {
            return (SDHCRES)result;
        }
        buff += IO_SDCARD_BLOCK_SIZE;
    }

    //等待传输结束
    if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_FLUSH_OUTPUT, NULL)))
    {
        return (SDHCRES)result;
    }

    //等待卡准备好/传输状态
    do
    {
        command.COMMAND = ESDHC_CMD13;
        command.ARGUMENT = sdcard_ptr->ADDRESS;
        command.BLOCKS = 0;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
        {
            return (SDHCRES)result;
        }

        //卡状态错误检查
        if (command.RESPONSE[0] & 0xFFD98008)
        {
            count = 0; /* necessary to get real number of written blocks */
            break;
        }

    } while (0x000000900 != (command.RESPONSE[0] & 0x00001F00));

    if (cnt != count)
    {
        //特殊应用命令
        command.COMMAND = ESDHC_CMD55;
        command.ARGUMENT = sdcard_ptr->ADDRESS;
        command.BLOCKS = 0;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
        {
            return (SDHCRES)result;
        }
                
        //使用ACMD22命令获得写入的块数量
        command.COMMAND = ESDHC_ACMD22;
        command.ARGUMENT = 0;
        command.BLOCKS = 1;
        command.BLOCKSIZE = 4;
        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_ESDHC_SEND_COMMAND, &command)))
        {
            return (SDHCRES)result;
        }
        
        if (4 != (result=sdhc_read (tmp, 4)))
        {
            return (SDHCRES)result;
            
        }

        if (SDHCRES_OK != (result=sdhc_ioc (IO_IOCTL_FLUSH_OUTPUT, NULL)))
        {
            return (SDHCRES)result;
        }

        count = (tmp[0] << 24) | (tmp[1] << 16) | (tmp[2] << 8) | tmp[3];
        if ((cnt < 0) || (cnt > count))
            return SDHCRES_ERROR;
    }
    
    return SDHCRES_OK;
}
